{
  "backend/main.mo": "Motoko actor defining the Kare2U backend with a hardcoded product catalog (9 skincare products across baby/adult categories) and blob storage mixin for file handling.",
  "feature_evidence.json": "Feature evidence report mapping the ShareModal/Header/Footer share-publish button update feature to its relevant source files and component dependencies.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the Kare2U frontend codebase.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme tokens (colors, borders, sidebar, charts).",
  "frontend/index.html": "Minimal HTML shell for the Kare2U React app, mounting the app into a root div and loading the main TypeScript entry point.",
  "frontend/src/App.tsx": "Root React component that composes all page sections (Header, Hero, BrandValues, ProductCatalog, WhyKare2U, BrandStory, Footer) and provides smooth-scroll and tab-switching navigation handlers.",
  "frontend/src/components/BrandStory.tsx": "Two-column section presenting Kare2U's origin story with a brand illustration, floating accent cards, decorative leaf motifs, and key brand stats.",
  "frontend/src/components/BrandValues.tsx": "Horizontal grid section displaying four brand value tiles (Fragrance-Free, Dermatologist-Inspired, Natural Ingredients, Family-Safe) with icons on a soft blue background.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, social media icon buttons, navigation links, and a share/publish modal trigger. Includes decorative leaf motifs and a copyright notice.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with scroll-aware background, desktop nav links, mobile hamburger menu, and Publish/Shop Now CTA buttons that open a ShareModal or scroll to sections.",
  "frontend/src/components/Hero.tsx": "Full-width hero section with a background image, decorative leaf motifs, brand tagline, and two CTA buttons for shopping baby and adult product categories.",
  "frontend/src/components/LeafMotif.tsx": "SVG leaf decorative component with configurable color, size, opacity, and rotation props, plus a LeafCluster composite that layers three offset LeafMotif instances.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product with its image (or emoji fallback), price badge, name, description, and an Add to Cart button, using product type and category to resolve the correct asset.",
  "frontend/src/components/ProductCatalog.tsx": "Product listing section with Baby/Adult tabs, fetches all products via useAllProducts hook, and renders a responsive grid of ProductCards with skeleton loading states.",
  "frontend/src/components/ShareModal.tsx": "A modal dialog component that displays the live site URL with a copy-to-clipboard button and a QR code generated via Google Charts API for sharing.",
  "frontend/src/components/WhyKare2U.tsx": "A marketing section component that renders three feature cards (eczema-focused formula, clean ingredients, all-ages suitability) explaining the Kare2U brand value proposition.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity state, and login status to child components.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all products and products filtered by category from the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind layers, defines Kare2U brand CSS custom properties (oklch colors, radii, shadows), and registers utility classes for fonts and brand colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Kare2U brand colors (oklch), custom fonts, border radii, box shadows, and animation keyframes, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks project state version 3 for a feature update targeting the ShareModal component and share/publish button in Header and Footer. Contains one existing feature entry with requirement REQ-1 and no new feature requests or known issues."
}