{
  "backend/main.mo": "Motoko actor defining the Kare2U backend with a hardcoded product catalog (9 skincare products across baby/adult categories) and blob storage mixin for asset handling.",
  "feature_evidence.json": "Feature evidence report mapping the 'Share Our Site' modal feature to its implementation files (Footer, Header, ShareModal) and associated test ID REQ-11.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference index for the Kare2U frontend codebase.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH CSS custom properties for light and dark theme tokens (colors, borders, sidebar, charts) used by shadcn-ui components.",
  "frontend/index.html": "Minimal HTML entry point for the Kare2U React app, mounting the app into a root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root React component that composes all page sections (Header, Hero, BrandValues, ProductCatalog, WhyKare2U, BrandStory, Footer) and provides smooth-scroll navigation with tab-switching helpers.",
  "frontend/src/components/BrandStory.tsx": "Two-column section presenting Kare2U's origin story with a brand illustration, floating accent cards, a quote overlay badge, and decorative leaf motifs.",
  "frontend/src/components/BrandValues.tsx": "Responsive grid section displaying four brand value tiles (Fragrance-Free, Dermatologist-Inspired, Natural Ingredients, Family-Safe) with icons on a soft blue background.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand info, social media icon buttons, navigation links, and a share button that opens a ShareModal. Includes decorative LeafMotif elements and a copyright notice.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header that becomes opaque on scroll, with desktop nav links, a Share button, a Shop Now CTA, and a collapsible mobile menu. Opens a ShareModal on share button click.",
  "frontend/src/components/Hero.tsx": "Full-width hero section with a background image, decorative leaf motifs, the brand tagline, and two CTA buttons (Shop Baby and Shop Adult) that trigger scroll-to-products callbacks.",
  "frontend/src/components/LeafMotif.tsx": "SVG leaf decorative component with configurable color, size, opacity, and rotation props, plus a LeafCluster composite that renders three overlapping leaves.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product with its image (or emoji fallback), type label, name, description, price badge, and an Add to Cart button styled with hover/active transitions.",
  "frontend/src/components/ProductCatalog.tsx": "Product listing section with Baby/Adult tabs, fetches all products via useAllProducts hook, renders a responsive grid of ProductCards with skeleton loading states and decorative leaf motifs.",
  "frontend/src/components/ShareModal.tsx": "A modal dialog that displays a QR code and copyable URL link for sharing the Kare2U website, using Google Charts API for QR generation and clipboard API for copying.",
  "frontend/src/components/WhyKare2U.tsx": "A marketing section component that renders three feature cards (eczema-focused formula, clean ingredients, all ages) explaining the Kare2U brand's value propositions.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Exports React Query hooks for fetching all products or products filtered by category from the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind layers, defines Kare2U brand CSS custom properties (oklch colors, radii, shadows), and registers utility classes for fonts and brand colors.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Kare2U brand colors (oklch), custom fonts, border radii, box shadows, and animation keyframes, with typography, container-queries, and animate plugins.",
  "project_state.json": "Stores the full project state for the Kare2U eczema skincare website, including brand palette, product catalog with names/prices, architectural notes, and a list of implemented features with their IDs and versions."
}