{
  "backend/main.mo": "Main Motoko actor for the Kare2U backend that defines product types (baby/adult, shampoo/conditioner/bodyWash/lotion/serum) and a static catalog of 9 products with prices, applying migrations on upgrade via MixinStorage.",
  "backend/migration.mo": "Migration module that defines old and new actor state types (adding `serum` product type and replacing `priceRange` with a numeric `price`) and rebuilds the full 9-product catalog in the new schema.",
  "feature_evidence.json": "Feature evidence report linking the ProductCard and ProductCatalog frontend update feature to its relevant files, components, and test ID REQ-10.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, serving as a reference for the project's frontend architecture and component responsibilities.",
  "frontend/index.css": "Base CSS file that sets up Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML entry point for the Kare2U React app, mounting the app into a `#root` div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that composes all page sections (Header, Hero, BrandValues, ProductCatalog, WhyKare2U, BrandStory, Footer) and provides smooth-scroll and tab-switching handlers for navigation.",
  "frontend/src/components/BrandStory.tsx": "Two-column brand story section featuring a brand illustration with overlay quote badge, floating accent cards, and narrative text about Kare2U's eczema-inspired origins.",
  "frontend/src/components/BrandValues.tsx": "Renders a section displaying four brand value cards (Fragrance-Free, Dermatologist-Inspired, Natural Ingredients, Family-Safe) with icons, descriptions, and decorative leaf accents.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with brand logo, tagline, social media icon buttons, navigation links, and a product list, laid out in a three-column grid on larger screens.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with scroll-aware background blur, desktop nav links, a 'Shop Now' CTA button, and a collapsible mobile menu.",
  "frontend/src/components/Hero.tsx": "Full-width hero section with a background image, decorative leaf motifs, brand logo, tagline, supporting copy, and 'Shop Baby' / 'Shop Adult' CTA buttons.",
  "frontend/src/components/LeafMotif.tsx": "Exports a configurable SVG leaf decorative element (LeafMotif) and a composite LeafCluster component, both used as purely visual accents throughout the UI.",
  "frontend/src/components/ProductCard.tsx": "Displays a single product as a card with its image (or emoji fallback), price badge, type label, name, description, and an 'Add to Cart' button.",
  "frontend/src/components/ProductCatalog.tsx": "Renders a tabbed product catalog section with 'baby' and 'adult' category tabs, displaying products in a responsive grid with loading skeletons and decorative leaf motifs.",
  "frontend/src/components/WhyKare2U.tsx": "Displays a 'Why Choose Us' section with three feature cards (eczema-focused formula, clean ingredients, all ages) using icons and styled with brand colors.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching all products and products filtered by category from the ICP backend actor.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind layers, and defines Kare2U brand CSS custom properties (colors, shadows, typography) for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Kare2U brand colors (oklch), custom fonts, border radii, box shadows, and animation keyframes, plus typography and animate plugins.",
  "project_state.json": "Defines the Kare2U project state including brand summary, color palette, product catalog with names/prices, architectural notes, and a list of existing implemented features for the eczema-focused skincare website."
}