{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add QR Code and Shareable Link for Kare2U Website",
  "requirements": [
    {
      "id": "REQ-11",
      "summary": "Add a 'Share Our Site' feature with QR code and copyable link accessible from the Header or Footer",
      "acceptanceCriteria": [
        "A QR code is displayed that encodes the Kare2U website URL",
        "The shareable URL is shown as readable text beneath or beside the QR code",
        "A 'Copy Link' button copies the URL to the clipboard when clicked",
        "The QR code and link UI uses the Kare2U brand palette and rounded styling",
        "The feature is accessible from the Header or Footer without breaking existing navigation"
      ],
      "file_operations": [
        {
          "path": "frontend/package.json",
          "operation": "modify",
          "description": "Add qrcode.react library to dependencies for client-side QR code generation"
        },
        {
          "path": "frontend/src/components/ShareModal.tsx",
          "operation": "create",
          "description": "Create a modal component that displays a QR code (generated using qrcode.react) encoding the Kare2U website URL, shows the full shareable URL as copyable text, and provides a 'Copy Link' button that copies the URL to clipboard. Style with Kare2U brand palette (light blue, soft green, white) using custom properties from index.css, rounded corners, and clean layout. Include close button and backdrop overlay."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Add a 'Share' button to the Header navigation (both desktop and mobile views) that opens the ShareModal component when clicked. Position appropriately within the existing navigation structure without breaking current layout. Import and wire the ShareModal component with open/close state management."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Add a 'Share Our Site' link or button to the Footer navigation links that opens the ShareModal component when clicked. Import and wire the ShareModal component with open/close state management, ensuring it integrates cleanly with the existing three-column footer layout."
        }
      ]
    }
  ]
}