{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Share/Publish Modal and Button",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update the ShareModal component and/or the share/publish button in the Header and Footer to improve its appearance, copy, or behavior as directed by the user",
      "acceptanceCriteria": [
        "The share/publish button and/or ShareModal reflect the requested change in both the Header and Footer components.",
        "The ShareModal still opens correctly when the share button is clicked.",
        "No regressions in QR code display or URL copy functionality."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ShareModal.tsx",
          "operation": "modify",
          "description": "Update the ShareModal component according to user requirements. This may include changes to modal content, copy text, QR code URL, link display, styling, or behavior. Ensure QR code generation via Google Charts API and clipboard copy functionality remain functional. Keep the modal's open/close props and callback interface unchanged so Header and Footer integration continues to work."
        },
        {
          "path": "frontend/src/components/Header.tsx",
          "operation": "modify",
          "description": "Update the share/publish button appearance, label, or behavior in the Header component to match the agreed changes. Ensure the button still triggers the ShareModal correctly when clicked. Apply consistent styling and copy with the Footer implementation."
        },
        {
          "path": "frontend/src/components/Footer.tsx",
          "operation": "modify",
          "description": "Update the share/publish button appearance, label, or behavior in the Footer component to match the agreed changes. Ensure the button still triggers the ShareModal correctly when clicked. Apply consistent styling and copy with the Header implementation."
        }
      ]
    }
  ]
}